HenryHet2DHighVar/steadystate/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoDarcyFoam;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         1;

deltaT          1.;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      1;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

adjustTimeStep  no;

runTimeModifiable yes;

maxDeltaT	60.;

//- for Picard time step control
timeStepControl Picard;
dTFactIncrease  1.0;
dTFactDecrease  1.0;

//- for h variation time step control
//timeStepControl dthetamax;
//dthetamax           0.01;

// ************************************************************************* //
